In [3]:
import numpy as np
import pandas as pd

In [4]:
data1 = pd.DataFrame({"score":[60,np.nan,75,80],
                     "level":[np.nan,"a",np.nan,"f"],
                    "cost":[1000,1500,np.nan,1200]})
data2 = pd.DataFrame({"score":[34,58,np.nan],
                    "level":[np.nan,"c","s"]})

In [5]:
data1

     cost level  score
0  1000.0   NaN   60.0
1  1500.0     a    NaN
2     NaN   NaN   75.0
3  1200.0     f   80.0

In [6]:
data2

  level  score
0   NaN   34.0
1     c   58.0
2     s    NaN

In [7]:
data1.combine_first(data2)

     cost level  score
0  1000.0   NaN   60.0
1  1500.0     a   58.0
2     NaN     s   75.0
3  1200.0     f   80.0

# heading

是需要运行以后才会形成文本

进入markdown的方法：按esc键进入命令模式，然后再按M键。 运行以后形成文本。

按Y键重新回到命令模式。

Markdown的命令模式下，直接输入1、2、3、4、等，可直接输入一二三四级标题。

## head

#### link